package huawei;
/*      [找城市]张地图上有n个城市。 城市和城市之间有且只有一条道路相连:要么直接相迹，要么通过其它城市中转相连
        （可中转-次或多次)。城市与城市之间的道路不会成环。当切断通往某个城市的所有道路后， 地图上将分为多个连通
        的城市群，设该城市的聚集度为DPI (Degree of Polymerizaton)， DP = max城市群1的城市个数，城市群2的城市个
        数城市群m的城市个数)。请找出地图 上DPI值最小的城市(即找到城市，使得DPI min(DPI. DP2 DPn))提示:如
        果有多个城市都满足条件，这些城市都要找出来
        输入描述:
        每个样例:第一行有一个整数N.表示有N个节点。1<=N-=1000
        接下来的N-I行每行有两个整数xy.表示城市x与城市y连接。Icx.ycN
        输出描述:
        输出城市的编号，如果有多个，按照编号升序输出
        示例1:输入
        5I
        12
        23
        34
        45
        输出
        3
 */
public class FoundCity {



}
